GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F06Q20.inc
;----- OSCEN Bits -----------------------------------------------------
PLLEN            EQU  H'0000'
ADOEN            EQU  H'0002'
SOSCEN           EQU  H'0003'
LFOEN            EQU  H'0004'
MFOEN            EQU  H'0005'
HFOEN            EQU  H'0006'
EXTOEN           EQU  H'0007'


;----- OSCTUNE Bits -----------------------------------------------------
TUN0             EQU  H'0000'
TUN1             EQU  H'0001'
TUN2             EQU  H'0002'
TUN3             EQU  H'0003'
TUN4             EQU  H'0004'
TUN5             EQU  H'0005'


;----- OSCFRQ Bits -----------------------------------------------------
FRQ0             EQU  H'0000'
FRQ1             EQU  H'0001'
FRQ2             EQU  H'0002'
FRQ3             EQU  H'0003'


;----- ACTCON Bits -----------------------------------------------------
ORS              EQU  H'0001'
LOCK             EQU  H'0003'
UD               EQU  H'0006'
EN               EQU  H'0007'
ACTORS           EQU  H'0001'
ACTLOCK          EQU  H'0003'
ACTUD            EQU  H'0006'
ACTEN            EQU  H'0007'


;----- FSCMCON Bits -----------------------------------------------------
FSCMFEV          EQU  H'0000'
FSCMFFI          EQU  H'0001'
FSCMPEV          EQU  H'0002'
FSCMPFI          EQU  H'0003'
FSCMSEV          EQU  H'0004'
FSCMSFI          EQU  H'0005'


;----- I3C1CON0 Bits -----------------------------------------------------
IBIREQ           EQU  H'0000'
HJREQ            EQU  H'0001'
ACKP             EQU  H'0002'
CLRRXB           EQU  H'0003'
CLRTXB           EQU  H'0004'
RST              EQU  H'0005'
BTOEN            EQU  H'0006'
EN               EQU  H'0007'


;----- I3C1CON1 Bits -----------------------------------------------------
ACKPOS           EQU  H'0000'
SASDRMD          EQU  H'0001'
FHDRE            EQU  H'0002'


;----- I3C1STAT0 Bits -----------------------------------------------------
RXBF             EQU  H'0002'
TXBE             EQU  H'0003'
RSTDET           EQU  H'0004'
BFREE            EQU  H'0007'


;----- I3C1STAT1 Bits -----------------------------------------------------
TXFNE            EQU  H'0000'


;----- I3C1BSTAT Bits -----------------------------------------------------
TE0ERR           EQU  H'0000'
TE1ERR           EQU  H'0001'
TE2ERR           EQU  H'0002'
TE3ERR           EQU  H'0003'
TE4ERR           EQU  H'0004'
TE5ERR           EQU  H'0005'
TE6ERR           EQU  H'0006'


;----- I3C1PIR0 Bits -----------------------------------------------------
SCCCIF           EQU  H'0000'
BTFIF            EQU  H'0001'
DADRIF           EQU  H'0002'
SADRIF           EQU  H'0003'
I2CACKIF         EQU  H'0004'
RSCIF            EQU  H'0005'
PCIF             EQU  H'0006'
SCIF             EQU  H'0007'


;----- I3C1PIR1 Bits -----------------------------------------------------
IBIDONEIF        EQU  H'0005'
DACHIF           EQU  H'0006'
TCOMPIF          EQU  H'0007'


;----- I3C1ERRIR0 Bits -----------------------------------------------------
UCCCIF           EQU  H'0000'
BTOIF            EQU  H'0001'
BUSEIF           EQU  H'0002'
IBIEIF           EQU  H'0003'
HJEIF            EQU  H'0004'
RXOIF            EQU  H'0005'
TXUIF            EQU  H'0006'
I2CNACKIF        EQU  H'0007'


;----- I3C1ERRIR1 Bits -----------------------------------------------------
RXREIF           EQU  H'0000'
TXWEIF           EQU  H'0001'
MWLOEIF          EQU  H'0002'
ABEIF            EQU  H'0003'


;----- I3C1PIE0 Bits -----------------------------------------------------
SCCCIE           EQU  H'0000'
BTFIE            EQU  H'0001'
DADRIE           EQU  H'0002'
SADRIE           EQU  H'0003'
I2CACKIE         EQU  H'0004'
RSCIE            EQU  H'0005'
PCIE             EQU  H'0006'
SCIE             EQU  H'0007'


;----- I3C1PIE1 Bits -----------------------------------------------------
IBIDONEIE        EQU  H'0005'
DACHIE           EQU  H'0006'
TCOMPIE          EQU  H'0007'


;----- I3C1ERRIE0 Bits -----------------------------------------------------
UCCCIE           EQU  H'0000'
BTOIE            EQU  H'0001'
BUSEIE           EQU  H'0002'
IBIEIE           EQU  H'0003'
HJEIE            EQU  H'0004'
RXOIE            EQU  H'0005'
TXUIE            EQU  H'0006'
I2CNACKIE        EQU  H'0007'


;----- I3C1ERRIE1 Bits -----------------------------------------------------
RXREIE           EQU  H'0000'
TXWEIE           EQU  H'0001'
MWLOEIE          EQU  H'0002'
ABEIE            EQU  H'0003'


;----- I3C1FEAT Bits -----------------------------------------------------
HJCAP            EQU  H'0000'
HDRCAP           EQU  H'0001'


;----- I3C1EC Bits -----------------------------------------------------
IBIEN            EQU  H'0000'
CREN             EQU  H'0001'
EC2              EQU  H'0002'
HJEN             EQU  H'0003'


;----- I3C1PID0 Bits -----------------------------------------------------
PID0             EQU  H'0000'
PID1             EQU  H'0001'
PID2             EQU  H'0002'
PID3             EQU  H'0003'
PID4             EQU  H'0004'
PID5             EQU  H'0005'
PID6             EQU  H'0006'
PID7             EQU  H'0007'


;----- I3C1PID1 Bits -----------------------------------------------------
PID8             EQU  H'0000'
PID9             EQU  H'0001'
PID10            EQU  H'0002'
PID11            EQU  H'0003'
PID12            EQU  H'0004'
PID13            EQU  H'0005'
PID14            EQU  H'0006'
PID15            EQU  H'0007'


;----- I3C1PID2 Bits -----------------------------------------------------
PID16            EQU  H'0000'
PID17            EQU  H'0001'
PID18            EQU  H'0002'
PID19            EQU  H'0003'
PID20            EQU  H'0004'
PID21            EQU  H'0005'
PID22            EQU  H'0006'
PID23            EQU  H'0007'


;----- I3C1PID3 Bits -----------------------------------------------------
PID24            EQU  H'0000'
PID25            EQU  H'0001'
PID26            EQU  H'0002'
PID27            EQU  H'0003'
PID28            EQU  H'0004'
PID29            EQU  H'0005'
PID30            EQU  H'0006'
PID31            EQU  H'0007'


;----- I3C1PID4 Bits -----------------------------------------------------
PID32            EQU  H'0000'
PID33            EQU  H'0001'
PID34            EQU  H'0002'
PID35            EQU  H'0003'
PID36            EQU  H'0004'
PID37            EQU  H'0005'
PID38            EQU  H'0006'
PID39            EQU  H'0007'


;----- I3C1PID5 Bits -----------------------------------------------------
PID40            EQU  H'0000'
PID41            EQU  H'0001'
PID42            EQU  H'0002'
PID43            EQU  H'0003'
PID44            EQU  H'0004'
PID45            EQU  H'0005'
PID46            EQU  H'0006'
PID47            EQU  H'0007'


;----- I3C1BCR Bits -----------------------------------------------------
BCR0             EQU  H'0000'
BCR1             EQU  H'0001'
BCR2             EQU  H'0002'
BCR3             EQU  H'0003'
BCR4             EQU  H'0004'
BCR5             EQU  H'0005'
BCR6             EQU  H'0006'
BCR7             EQU  H'0007'


