GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F06Q20.inc
;----- PIE0 Bits -----------------------------------------------------
SWIE             EQU  H'0000'
INT0IE           EQU  H'0001'
INT1IE           EQU  H'0002'
INT2IE           EQU  H'0003'
DMA1SCNTIE       EQU  H'0004'
DMA1DCNTIE       EQU  H'0005'
DMA1ORIE         EQU  H'0006'
DMA1AIE          EQU  H'0007'


;----- PIE1 Bits -----------------------------------------------------
DMA2SCNTIE       EQU  H'0000'
DMA2DCNTIE       EQU  H'0001'
DMA2ORIE         EQU  H'0002'
DMA2AIE          EQU  H'0003'
DMA3SCNTIE       EQU  H'0004'
DMA3DCNTIE       EQU  H'0005'
DMA3ORIE         EQU  H'0006'
DMA3AIE          EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
DMA4SCNTIE       EQU  H'0000'
DMA4DCNTIE       EQU  H'0001'
DMA4ORIE         EQU  H'0002'
DMA4AIE          EQU  H'0003'
NVMIE            EQU  H'0004'
CRCIE            EQU  H'0005'
SCANIE           EQU  H'0006'
ACTIE            EQU  H'0007'


;----- PIE3 Bits -----------------------------------------------------
CSWIE            EQU  H'0000'
OSFIE            EQU  H'0001'
VDDIO2IE         EQU  H'0002'
IOCIE            EQU  H'0004'
TMR0IE           EQU  H'0005'
TMR1IE           EQU  H'0006'
TMR1GIE          EQU  H'0007'


;----- PIE4 Bits -----------------------------------------------------
TMR2IE           EQU  H'0000'
TMR4IE           EQU  H'0001'
TU16AIE          EQU  H'0002'
TU16BIE          EQU  H'0003'
CCP1IE           EQU  H'0004'
CCP2IE           EQU  H'0005'
PWM1PIE          EQU  H'0006'
PWM1IE           EQU  H'0007'


;----- PIE5 Bits -----------------------------------------------------
PWM2PIE          EQU  H'0000'
PWM2IE           EQU  H'0001'
CWG1IE           EQU  H'0002'
CLC1IE           EQU  H'0003'
CLC2IE           EQU  H'0004'
CLC3IE           EQU  H'0005'
CLC4IE           EQU  H'0006'
IOCSRIE          EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
U1RXIE           EQU  H'0000'
U1TXIE           EQU  H'0001'
U1IE             EQU  H'0002'
U1EIE            EQU  H'0003'
U2RXIE           EQU  H'0004'
U2TXIE           EQU  H'0005'
U2IE             EQU  H'0006'
U2EIE            EQU  H'0007'


;----- PIE7 Bits -----------------------------------------------------
SPI1RXIE         EQU  H'0000'
SPI1TXIE         EQU  H'0001'
SPI1IE           EQU  H'0002'
I2C1RXIE         EQU  H'0003'
I2C1TXIE         EQU  H'0004'
I2C1IE           EQU  H'0005'
I2C1EIE          EQU  H'0006'


;----- PIE8 Bits -----------------------------------------------------
I3C1RXIE         EQU  H'0000'
I3C1TXIE         EQU  H'0001'
I3C1IE           EQU  H'0002'
I3C1EIE          EQU  H'0003'
I3C1RIE          EQU  H'0004'


;----- PIE9 Bits -----------------------------------------------------
HLVDIE           EQU  H'0005'
ADIE             EQU  H'0006'
ADTIE            EQU  H'0007'


;----- IPR0 Bits -----------------------------------------------------
SWIP             EQU  H'0000'
INT0IP           EQU  H'0001'
INT1IP           EQU  H'0002'
INT2IP           EQU  H'0003'
DMA1SCNTIP       EQU  H'0004'
DMA1DCNTIP       EQU  H'0005'
DMA1ORIP         EQU  H'0006'
DMA1AIP          EQU  H'0007'


;----- IPR1 Bits -----------------------------------------------------
DMA2SCNTIP       EQU  H'0000'
DMA2DCNTIP       EQU  H'0001'
DMA2ORIP         EQU  H'0002'
DMA2AIP          EQU  H'0003'
DMA3SCNTIP       EQU  H'0004'
DMA3DCNTIP       EQU  H'0005'
DMA3ORIP         EQU  H'0006'
DMA3AIP          EQU  H'0007'


;----- IPR2 Bits -----------------------------------------------------
DMA4SCNTIP       EQU  H'0000'
DMA4DCNTIP       EQU  H'0001'
DMA4ORIP         EQU  H'0002'
DMA4AIP          EQU  H'0003'
NVMIP            EQU  H'0004'
CRCIP            EQU  H'0005'
SCANIP           EQU  H'0006'
ACTIP            EQU  H'0007'


;----- IPR3 Bits -----------------------------------------------------
CSWIP            EQU  H'0000'
OSFIP            EQU  H'0001'
VDDIO2IP         EQU  H'0002'
IOCIP            EQU  H'0004'
TMR0IP           EQU  H'0005'
TMR1IP           EQU  H'0006'
TMR1GIP          EQU  H'0007'


;----- IPR4 Bits -----------------------------------------------------
TMR2IP           EQU  H'0000'
TMR4IP           EQU  H'0001'
TU16AIP          EQU  H'0002'
TU16BIP          EQU  H'0003'
CCP1IP           EQU  H'0004'
CCP2IP           EQU  H'0005'
PWM1PIP          EQU  H'0006'
PWM1IP           EQU  H'0007'


;----- IPR5 Bits -----------------------------------------------------
PWM2PIP          EQU  H'0000'
PWM2IP           EQU  H'0001'
CWG1IP           EQU  H'0002'
CLC1IP           EQU  H'0003'
CLC2IP           EQU  H'0004'
CLC3IP           EQU  H'0005'
CLC4IP           EQU  H'0006'
IOCSRIP          EQU  H'0007'


;----- IPR6 Bits -----------------------------------------------------
U1RXIP           EQU  H'0000'
U1TXIP           EQU  H'0001'
U1IP             EQU  H'0002'
U1EIP            EQU  H'0003'
U2RXIP           EQU  H'0004'
U2TXIP           EQU  H'0005'
U2IP             EQU  H'0006'
U2EIP            EQU  H'0007'


;----- IPR7 Bits -----------------------------------------------------
SPI1RXIP         EQU  H'0000'
SPI1TXIP         EQU  H'0001'
SPI1IP           EQU  H'0002'
I2C1RXIP         EQU  H'0003'
I2C1TXIP         EQU  H'0004'
I2C1IP           EQU  H'0005'
I2C1EIP          EQU  H'0006'


;----- IPR8 Bits -----------------------------------------------------
I3C1RXIP         EQU  H'0000'
I3C1TXIP         EQU  H'0001'
I3C1IP           EQU  H'0002'
I3C1EIP          EQU  H'0003'
I3C1RIP          EQU  H'0004'


;----- IPR9 Bits -----------------------------------------------------
HLVDIP           EQU  H'0005'
ADIP             EQU  H'0006'
ADTIP            EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'


