GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F06Q20.inc
;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- PORTW Bits -----------------------------------------------------
RW0              EQU  H'0000'
RW1              EQU  H'0001'
RW2              EQU  H'0002'
RW3              EQU  H'0003'
RW4              EQU  H'0004'
RW5              EQU  H'0005'
RW6              EQU  H'0006'
RW7              EQU  H'0007'


;----- LATW Bits -----------------------------------------------------
LATW0            EQU  H'0000'
LATW1            EQU  H'0001'
LATW2            EQU  H'0002'
LATW3            EQU  H'0003'
LATW4            EQU  H'0004'
LATW5            EQU  H'0005'
LATW6            EQU  H'0006'
LATW7            EQU  H'0007'


;----- PORTWIN0 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN1 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN2 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN3 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN4 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN5 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN6 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN7 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'


;----- PORTWDF Bits -----------------------------------------------------
DF0              EQU  H'0000'
DF1              EQU  H'0001'
DF2              EQU  H'0002'
DF3              EQU  H'0003'
DF4              EQU  H'0004'
DF5              EQU  H'0005'
DF6              EQU  H'0006'
DF7              EQU  H'0007'
PWDF0            EQU  H'0000'
PWDF1            EQU  H'0001'
PWDF2            EQU  H'0002'
PWDF3            EQU  H'0003'
PWDF4            EQU  H'0004'
PWDF5            EQU  H'0005'
PWDF6            EQU  H'0006'
PWDF7            EQU  H'0007'


;----- PORTWCON Bits -----------------------------------------------------
CLKEN            EQU  H'0000'


;----- MVIOSTAT Bits -----------------------------------------------------
VDDIO2RDY        EQU  H'0000'


;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
OV_STATUS        EQU  H'0003'
N                EQU  H'0004'
PD               EQU  H'0005'
TO               EQU  H'0006'


;----- PCON0 Bits -----------------------------------------------------
NOT_BOR          EQU  H'0000'
NOT_POR          EQU  H'0001'
NOT_RI           EQU  H'0002'
NOT_RMCLR        EQU  H'0003'
NOT_RWDT         EQU  H'0004'
NOT_WDTWV        EQU  H'0005'
NBOR             EQU  H'0000'
NPOR             EQU  H'0001'
NRI              EQU  H'0002'
NRMCLR           EQU  H'0003'
NRWDT            EQU  H'0004'
NWDTWV           EQU  H'0005'
STKUNF           EQU  H'0006'
STKOVF           EQU  H'0007'
BOR              EQU  H'0000'
POR              EQU  H'0001'
RI               EQU  H'0002'
RMCLR            EQU  H'0003'
RWDT             EQU  H'0004'
WDTWV            EQU  H'0005'


;----- PCON1 Bits -----------------------------------------------------
NOT_RCM          EQU  H'0000'
NOT_MEMV         EQU  H'0001'
NOT_RVREG        EQU  H'0002'
NOT_PORVDDIO2    EQU  H'0003'
NRCM             EQU  H'0000'
NMEMV            EQU  H'0001'
NRVREG           EQU  H'0002'
NPORVDDIO2       EQU  H'0003'
RCM              EQU  H'0000'
MEMV             EQU  H'0001'
RVREG            EQU  H'0002'
PORVDDIO2        EQU  H'0003'


;----- CPUDOZE Bits -----------------------------------------------------
DOE              EQU  H'0004'
ROI              EQU  H'0005'
DOZEN            EQU  H'0006'
IDLEN            EQU  H'0007'
DOZE0            EQU  H'0000'
DOZE1            EQU  H'0001'
DOZE2            EQU  H'0002'

;==========================================================================
;
;       RAM Definitions
;
;==========================================================================

__MAXRAM  H'14FF'
__BADRAM  H'0000'-H'0037'
__BADRAM  H'0102'
__BADRAM  H'010E'-H'0119'
__BADRAM  H'0125'-H'012A'
__BADRAM  H'0171'-H'0198'
__BADRAM  H'01A2'
__BADRAM  H'01BF'
__BADRAM  H'01C4'
__BADRAM  H'01C6'
__BADRAM  H'01E3'
__BADRAM  H'0200'
__BADRAM  H'0204'-H'0214'
__BADRAM  H'0238'
__BADRAM  H'023A'
__BADRAM  H'023B'
__BADRAM  H'023C'
__BADRAM  H'0305'-H'0312'
__BADRAM  H'0314'
__BADRAM  H'0317'-H'0318'
__BADRAM  H'031C'
__BADRAM  H'031F'
__BADRAM  H'0320'
__BADRAM  H'0321'
__BADRAM  H'0322'
__BADRAM  H'0323'
__BADRAM  H'0324'
__BADRAM  H'0325'
__BADRAM  H'032B'
__BADRAM  H'0331'-H'0350'
__BADRAM  H'0358'-H'035F'
__BADRAM  H'0362'-H'0364'
__BADRAM  H'0367'-H'0368'
__BADRAM  H'036B'-H'0372'
__BADRAM  H'0388'-H'0398'
__BADRAM  H'039A'-H'039C'
__BADRAM  H'03A5'-H'03A6'
__BADRAM  H'03AA'-H'03AC'
__BADRAM  H'03AF'-H'03B0'
__BADRAM  H'03B2'
__BADRAM  H'0400'-H'0415'
__BADRAM  H'041E'-H'041F'
__BADRAM  H'0420'
__BADRAM  H'0421'
__BADRAM  H'0422'
__BADRAM  H'0423'
__BADRAM  H'0424'
__BADRAM  H'0425'
__BADRAM  H'0426'
__BADRAM  H'0427'
__BADRAM  H'0428'-H'0429'
__BADRAM  H'0432'-H'0456'
__BADRAM  H'0488'
__BADRAM  H'048A'
__BADRAM  H'048B'
__BADRAM  H'048C'
__BADRAM  H'048E'
__BADRAM  H'0490'
__BADRAM  H'0491'
__BADRAM  H'0492'
__BADRAM  H'0494'
__BADRAM  H'0496'
__BADRAM  H'0497'
__BADRAM  H'0498'
__BADRAM  H'04A7'-H'04D7'


