GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F06Q20.inc
;----- CONFIG10 Options --------------------------------------------------
_WRTB_OFF_10         EQU  H'FF'; Boot Block is not write-protected
_WRTB_ON_10          EQU  H'FE'; Boot Block is write-protected
_WRTC_OFF_10         EQU  H'FF'; Configuration registers are not write-protected
_WRTC_ON_10          EQU  H'FD'; Configuration registers are write-protected
_WRTD_OFF_10         EQU  H'FF'; Data EEPROM is not write-protected
_WRTD_ON_10          EQU  H'FB'; Data EEPROM is write-protected
_WRTSAF_OFF_10       EQU  H'FF'; SAF is not write-protected
_WRTSAF_ON_10        EQU  H'F7'; SAF is write-protected
_WRTAPP_OFF_10       EQU  H'FF'; Application Block is not write-protected
_WRTAPP_ON_10        EQU  H'7F'; Application Block is write-protected

;----- CONFIG11 Options --------------------------------------------------
_CP_OFF_11           EQU  H'FF'; User PFM code protection is disabled
_CP_ON_11            EQU  H'FE'; User PFM code protection is enabled

;----- CONFIG12 Options --------------------------------------------------
_CPD_OFF_12          EQU  H'FF'; Data EEPROM code protection is disabled
_CPD_ON_12           EQU  H'FE'; Data EEPROM code protection is enabled

;----- CONFIG14 Options --------------------------------------------------
_SAFLOCK_OFF_14      EQU  H'FF'; SAF Lock disabled
_SAFLOCK_ON_14       EQU  H'FE'; SAF Lock enabled, SAF areas are locked and SAFSZ bits cannot be erased

;----- CONFIG9 Options --------------------------------------------------
_SAFSZ_SAFSZ_NONE_9  EQU  H'FF'; NONE
_SAFSZ_SAFSZ_128_9   EQU  H'FE'; Last 128 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_256_9   EQU  H'FC'; Last 256 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_384_9   EQU  H'F8'; Last 384 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_512_9   EQU  H'F0'; Last 512 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_640_9   EQU  H'E0'; Last 640 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_768_9   EQU  H'C0'; Last 768 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_896_9   EQU  H'80'; Last 896 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_1024_9  EQU  H'00'; Last 1024 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits

;----- DEVID Equates --------------------------------------------------
_IDLOC0            EQU  H'200000'
_IDLOC1            EQU  H'200001'
_IDLOC2            EQU  H'200002'
_IDLOC3            EQU  H'200003'
_IDLOC4            EQU  H'200004'
_IDLOC5            EQU  H'200005'
_IDLOC6            EQU  H'200006'
_IDLOC7            EQU  H'200007'
_IDLOC8            EQU  H'200008'
_IDLOC9            EQU  H'200009'
_IDLOC10           EQU  H'20000A'
_IDLOC11           EQU  H'20000B'
_IDLOC12           EQU  H'20000C'
_IDLOC13           EQU  H'20000D'
_IDLOC14           EQU  H'20000E'
_IDLOC15           EQU  H'20000F'
_IDLOC16           EQU  H'200010'
_IDLOC17           EQU  H'200011'
_IDLOC18           EQU  H'200012'
_IDLOC19           EQU  H'200013'
_IDLOC20           EQU  H'200014'
_IDLOC21           EQU  H'200015'
_IDLOC22           EQU  H'200016'
_IDLOC23           EQU  H'200017'
_IDLOC24           EQU  H'200018'
_IDLOC25           EQU  H'200019'
_IDLOC26           EQU  H'20001A'
_IDLOC27           EQU  H'20001B'
_IDLOC28           EQU  H'20001C'
_IDLOC29           EQU  H'20001D'
_IDLOC30           EQU  H'20001E'
_IDLOC31           EQU  H'20001F'
_IDLOC32           EQU  H'200020'
_IDLOC33           EQU  H'200021'
_IDLOC34           EQU  H'200022'
_IDLOC35           EQU  H'200023'
_IDLOC36           EQU  H'200024'
_IDLOC37           EQU  H'200025'
_IDLOC38           EQU  H'200026'
_IDLOC39           EQU  H'200027'
_IDLOC40           EQU  H'200028'
_IDLOC41           EQU  H'200029'
_IDLOC42           EQU  H'20002A'
_IDLOC43           EQU  H'20002B'
_IDLOC44           EQU  H'20002C'
_IDLOC45           EQU  H'20002D'
_IDLOC46           EQU  H'20002E'
_IDLOC47           EQU  H'20002F'
_IDLOC48           EQU  H'200030'
_IDLOC49           EQU  H'200031'
_IDLOC50           EQU  H'200032'
_IDLOC51           EQU  H'200033'
_IDLOC52           EQU  H'200034'
_IDLOC53           EQU  H'200035'
_IDLOC54           EQU  H'200036'
_IDLOC55           EQU  H'200037'
_IDLOC56           EQU  H'200038'
_IDLOC57           EQU  H'200039'
_IDLOC58           EQU  H'20003A'
_IDLOC59           EQU  H'20003B'
_IDLOC60           EQU  H'20003C'
_IDLOC61           EQU  H'20003D'
_IDLOC62           EQU  H'20003E'
_IDLOC63           EQU  H'20003F'

        LIST
